Masmiseim36/nxpSDK/boards/frdmke16z/demo_apps/touch_sensing/pin_mux.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v5.0
processor: MKE16Z64xxx4
package_id: MKE16Z64VLF4
mcu_data: ksdk2_0
processor_version: 0.0.5
board: FRDM-KE16Z
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

#define PIN5_IDX                         5u   /*!< Pin number for pin 5 in a port */
#define PIN4_IDX                         4u   /*!< Pin number for pin 4 in a port */
#define PIN1_IDX                         1u   /*!< Pin number for pin 1 in a port */

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '15', peripheral: FTM0, signal: 'CH, 5', pin_signal: PTB5/TSI0_CH9/FTM0_CH5/LPSPI0_PCS1/TRGMUX_IN0}
  - {pin_num: '16', peripheral: FTM0, signal: 'CH, 4', pin_signal: PTB4/TSI0_CH8/FTM0_CH4/LPSPI0_SOUT/TRGMUX_IN1}
  - {pin_num: '1', peripheral: FTM0, signal: 'CH, 3', pin_signal: PTD1/TSI0_CH5/FTM0_CH3/TRGMUX_OUT2}
  - {pin_num: '26', peripheral: LPUART0, signal: TX, pin_signal: ADC0_SE5/PTB1/LPUART0_TX/LPSPI0_SOUT/TCLK0, digital_filter: disable}
  - {pin_num: '27', peripheral: LPUART0, signal: RX, pin_signal: ADC0_SE4/PTB0/LPUART0_RX/LPSPI0_PCS0/LPTMR0_ALT3/PWT_IN3, digital_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_PortB);                           /* Clock Control: 0x01u */
  CLOCK_EnableClock(kCLOCK_PortD);                           /* Clock Control: 0x01u */

  /* PORTB0 (pin 27) is configured as LPUART0_RX */
  PORT_SetPinMux(BOARD_DEBUG_UART_RX_PORT, BOARD_DEBUG_UART_RX_PIN, kPORT_MuxAlt2);

  /* PORTB1 (pin 26) is configured as LPUART0_TX */
  PORT_SetPinMux(BOARD_DEBUG_UART_TX_PORT, BOARD_DEBUG_UART_TX_PIN, kPORT_MuxAlt2);
  
  PORT_SetPinMux(PORTB, PIN5_IDX, kPORT_MuxAlt2);           /* PORTB5 (pin 15) is configured as FTM0_CH5 */
  PORT_SetPinMux(PORTB, PIN4_IDX, kPORT_MuxAlt2);           /* PORTB4 (pin 16) is configured as FTM0_CH4 */
  PORT_SetPinMux(PORTD, PIN1_IDX, kPORT_MuxAlt2);           /* PORTD1 (pin 1) is configured as FTM0_CH3 */
}

/*******************************************************************************
 * EOF
 **********************************************************************************************************************/
